qm2813518589/LPC54606_Library/Libraries/seekfree/SEEKFREE_IPS200_PARALLEL8.c
/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2018,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		IPS 2.0寸液晶
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ790875685)
 * @version    		查看doc内version文件 版本说明
 * @Software 		IAR 8.3 or MDK 5.26
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2019-09-17
 * @note		
					接线定义：
					------------------------------------ 
						模块管脚            单片机管脚
						D0                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D0_PIN  宏定义
						D1                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D1_PIN  宏定义
						D2                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D2_PIN  宏定义
						D3                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D3_PIN  宏定义
						D4                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D4_PIN  宏定义
						D5                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D5_PIN  宏定义
						D6                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D6_PIN  宏定义
						D7                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_D7_PIN  宏定义
                                                                                        
						BL                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_BL_PIN  宏定义
						CS                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_CS_PIN  宏定义
						RD                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_RD_PIN  宏定义
						WR                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_WR_PIN  宏定义
						RS                 查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_RS_PIN  宏定义
						RST                查看SEEKFREE_IPS200_PARALLEL8.H文件内的IPS200_RST_PIN 宏定义

						电源引脚
						VCC 3.3V电源
						GND 电源地
						最大分辨率240*320
					------------------------------------ 

 ********************************************************************************************************************/

#include "stdlib.h"
#include "string.h"

#include "LPC546XX_iocon.h"
#include "LPC546XX_gpio.h"

#include "SEEKFREE_IPS200_PARALLEL8.h"
#include "SEEKFREE_FONT.h"
#include "LPC546XX_pll.h"
#include "LPC546XX_systick.h"

//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_w_data(uint8 dat)			//写数据
{
	IPS200_DATAPORT = (dat << DATA_START_NUM);
}



//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_wr_reg(uint16 com)			//写命令
{
	IPS200_CS(0);
	IPS200_RS(0);
	IPS200_RD(1);
	IPS200_WR(0);
	ips200_w_data(com);
	IPS200_WR(1);	
	IPS200_WR(1);
	IPS200_CS(1); 
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_wr_data(uint8 dat)			//向液晶屏写一个8位数据
{
	IPS200_CS(0); 
	IPS200_RS(1);
	IPS200_RD(1);
	IPS200_WR(0);
	ips200_w_data(dat);
	IPS200_WR(1);
	IPS200_WR(1);
	IPS200_CS(1); 
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_wr_data16(uint16 dat)		//向液晶屏写一个16位数据
{
	IPS200_CS(0); 
	IPS200_RS(1);
	IPS200_RD(1);
	IPS200_WR(0);
	ips200_w_data(dat>>8);
	IPS200_WR(1);
	IPS200_WR(1);
	IPS200_WR(0);
	ips200_w_data(dat);
	IPS200_WR(1);
	IPS200_WR(1);
	IPS200_CS(1); 	 	
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_w_reg(uint8 com,uint8 dat)		//写寄存器
{
	ips200_wr_reg(com);
	ips200_wr_data(dat);
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      内部调用，用户无需关心
//  @param      void 		    
//  @return     				
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_address_set(uint16 x1,uint16 y1,uint16 x2,uint16 y2)
{ 
	ips200_wr_reg(0x2a);
	ips200_wr_data16(x1);
	ips200_wr_data16(x2);
	
	ips200_wr_reg(0x2b);
	ips200_wr_data16(y1);
	ips200_wr_data16(y2);
	
	ips200_wr_reg(0x2c);
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      2.0寸 IPS液晶初始化
//  @return     void
//  @since      v1.0
//  Sample usage:               
//-------------------------------------------------------------------------------------------------------------------
void ips200_init(void)
{
    
	gpio_init(IPS200_D0_PIN, GPO, 0, NOPULL); 
	gpio_init(IPS200_D1_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D2_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D3_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D4_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D5_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D6_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_D7_PIN, GPO, 0, NOPULL); 
                                     
	gpio_init(IPS200_BL_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_CS_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_RST_PIN,GPO, 0, NOPULL);
	gpio_init(IPS200_RS_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_WR_PIN, GPO, 0, NOPULL);
	gpio_init(IPS200_RD_PIN, GPO, 0, NOPULL);
    
    GPIO->MASK[IPS200_D0_PIN >> 5] = ~((uint32)(0xff) << DATA_START_NUM);
	
	IPS200_BL(1);
	IPS200_RST(0);	
	systick_delay_ms(250);		
	IPS200_RST(1);		
	systick_delay_ms(250);	
	
