qm2813518589/LPC54606_Library/Libraries/seekfree/SEEKFREE_IPS200_PARALLEL8.c
	ips200_wr_reg(0x11);
	systick_delay_ms(120);	
	
	ips200_wr_reg(0x36);						
    if      (IPS200_DISPLAY_DIR==0)    ips200_wr_data(0x00);
    else if (IPS200_DISPLAY_DIR==1)    ips200_wr_data(0xC0);
    else if (IPS200_DISPLAY_DIR==2)    ips200_wr_data(0x70);
    else                            ips200_wr_data(0xA0);
    

	ips200_wr_reg(0x3A);			
	ips200_wr_data(0x05);
	
	ips200_wr_reg(0xB2);			
	ips200_wr_data(0x0C);
	ips200_wr_data(0x0C); 
	ips200_wr_data(0x00); 
	ips200_wr_data(0x33); 
	ips200_wr_data(0x33); 			

	ips200_wr_reg(0xB7);			
	ips200_wr_data(0x35);

	ips200_wr_reg(0xBB);			
	ips200_wr_data(0x29); //32 Vcom=1.35V
															
	ips200_wr_reg(0xC2);			
	ips200_wr_data(0x01);

	ips200_wr_reg(0xC3);			
	ips200_wr_data(0x19); //GVDD=4.8V 
															
	ips200_wr_reg(0xC4);			
	ips200_wr_data(0x20); //VDV, 0x20:0v

	ips200_wr_reg(0xC5);			
	ips200_wr_data(0x1A);//VCOM Offset Set

	ips200_wr_reg(0xC6);			
	ips200_wr_data(0x01F); //0x0F:60Hz        	

	ips200_wr_reg(0xD0);			
	ips200_wr_data(0xA4);
	ips200_wr_data(0xA1); 											  												  																								
				
	ips200_wr_reg(0xE0);     
	ips200_wr_data(0xD0);   
	ips200_wr_data(0x08);   
	ips200_wr_data(0x0E);   
	ips200_wr_data(0x09);   
	ips200_wr_data(0x09);   
	ips200_wr_data(0x05);   
	ips200_wr_data(0x31);   
	ips200_wr_data(0x33);   
	ips200_wr_data(0x48);   
	ips200_wr_data(0x17);   
	ips200_wr_data(0x14);   
	ips200_wr_data(0x15);   
	ips200_wr_data(0x31);   
	ips200_wr_data(0x34);   

	ips200_wr_reg(0xE1);     
	ips200_wr_data(0xD0);   
	ips200_wr_data(0x08);   
	ips200_wr_data(0x0E);   
	ips200_wr_data(0x09);   
	ips200_wr_data(0x09); 
	ips200_wr_data(0x15);   
	ips200_wr_data(0x31);   
	ips200_wr_data(0x33);   
	ips200_wr_data(0x48);   
	ips200_wr_data(0x17);   
	ips200_wr_data(0x14);   
	ips200_wr_data(0x15);   
	ips200_wr_data(0x31);   
	ips200_wr_data(0x34);   

	ips200_wr_reg(0x21);
	
	ips200_wr_reg(0x29);
	ips200_clear(IPS200_BGCOLOR);	//初始化为白屏

//	ips200_address_set(0,0,240,320);			
} 

//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶清屏函数
//  @param      color     		颜色设置
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_clear(YELLOW);// 全屏设置为黄色
//-------------------------------------------------------------------------------------------------------------------
void ips200_clear(uint16 Color) 
{ 
	uint16 i,j;  	
	ips200_address_set(0,0,IPS200_X_MAX-1,IPS200_Y_MAX-1);
	for(i=0;i<IPS200_X_MAX;i++)
	{
		for (j=0;j<IPS200_Y_MAX;j++)
		{
			ips200_wr_data16(Color);	 			 
		}
	}
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶画点
//  @param      x     	        坐标x方向的起点
//  @param      y     	        坐标y方向的起点
//  @param      dat       	    需要显示的颜色
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_drawpoint(0,0,RED);  //坐标0,0画一个红色的点
//-------------------------------------------------------------------------------------------------------------------
void ips200_drawpoint(uint16 x,uint16 y,uint16 color)
{
    ips200_address_set(x,y,x,y);
    ips200_wr_data16(color);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶显示字符
//  @param      x     	        坐标x方向的起点 参数范围 0 - (IPS200_X_MAX-1)
//  @param      y     	        坐标y方向的起点 参数范围 0 - (IPS200_Y_MAX/16-1)
//  @param      dat       	    需要显示的字符
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_showchar(0,0,'x');//坐标0,0写一个字符x
//-------------------------------------------------------------------------------------------------------------------
void ips200_showchar(uint16 x,uint16 y,uint8 dat)
{
	uint8 i,j;
	uint8 temp;
    
	for(i=0; i<16; i++)
	{
		ips200_address_set(x,y+i,x+7,y+i);
		temp = tft_ascii[(uint16)dat-32][i];//减32因为是取模是从空格开始取得 空格在ascii中序号是32
		for(j=0; j<8; j++)
		{
			if(temp&0x01)	ips200_wr_data16(IPS200_PENCOLOR);
			else			ips200_wr_data16(IPS200_BGCOLOR);
			temp>>=1;
		}
	}
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶显示字符串
//  @param      x     	        坐标x方向的起点  参数范围 0 - (IPS200_X_MAX-1)
//  @param      y     	        坐标y方向的起点  参数范围 0 - (IPS200_Y_MAX/16-1)
//  @param      dat       	    需要显示的字符串
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_showstr(0,0,"seekfree");
//-------------------------------------------------------------------------------------------------------------------
void ips200_showstr(uint16 x,uint16 y,uint8 dat[])
{         
	uint16 j;
	
	j = 0;
	while(dat[j] != '\0')
	{
		ips200_showchar(x+8*j,y*16,dat[j]);
		j++;
	}
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶显示8位有符号
//  @param      x     	        坐标x方向的起点  参数范围 0 -（IPS_X_MAX-1）
//  @param      y     	        坐标y方向的起点  参数范围 0 -（IPS_Y_MAX/16-1）
//  @param      dat       	    需要显示的变量，数据类型int8
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_showint8(0,0,x);//x为int8类型
//-------------------------------------------------------------------------------------------------------------------
void ips200_showint8(uint16 x,uint16 y,int8 dat)
{
	uint8 a[3];
	uint8 i;
	if(dat<0)
	{
		ips200_showchar(x,y*16,'-');
		dat = -dat;
	}
	else	ips200_showchar(x,y*16,' ');
	
	a[0] = dat/100;
	a[1] = dat/10%10;
	a[2] = dat%10;
	i = 0;
	while(i<3)
	{
		ips200_showchar(x+(8*(i+1)),y*16,'0' + a[i]);
		i++;
	}
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      液晶显示8位无符号
//  @param      x     	        坐标x方向的起点 参数范围 0 -（IPS200_X_MAX-1）
//  @param      y     	        坐标y方向的起点 参数范围 0 -（IPS200_Y_MAX/16-1）
//  @param      dat       	    需要显示的变量，数据类型uint8
//  @return     void
//  @since      v1.0
//  Sample usage:               ips200_showuint8(0,0,x);//x为uint8类型
//-------------------------------------------------------------------------------------------------------------------
void ips200_showuint8(uint16 x,uint16 y,uint8 dat)
{
	uint8 a[3];
	uint8 i;
	
